# SetObjectVariableHandle

## Description
Sets the value of a VectorWorks object property.

```pascal
PROCEDURE SetObjectVariableHandle(
				h     : HANDLE;
				index : INTEGER;
				value : HANDLE);
```

```python
def vs.SetObjectVariableHandle(h, index, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|index|INTEGER|   |
|value|HANDLE|   |

## Version
Availability: from VectorWorks12.0

## Category
* Object Info